#### 写出导入pandas的语句，并且给pandas别名为`pd`。

In [1]:
import pandas as pd

#### 创建一个名为`students`的DataFrame，包含数据如下：
```{"001": {"姓名": "小陈", "考试1": 85, "考试2": 95, "考试3": 92},
 "002": {"姓名": "小李", "考试1": 91, "考试2": 92, "考试3": 94},
 "003": {"姓名": "小王", "考试1": 86, "考试2": 81, "考试3": 89},
 "004": {"姓名": "小张", "考试1": 79, "考试2": 89, "考试3": 95},
 "005": {"姓名": "小赵", "考试1": 96, "考试2": 91, "考试3": 91},
 "006": {"姓名": "小周", "考试1": 81, "考试2": 89, "考试3": 92}
 }```
 
 #### 要求学号（001、002等）为索引，姓名、考试1、考试2、考试3为列名，并输出创建好的DataFrame。

In [2]:
students = pd.DataFrame({"001": {"姓名": "小陈", "考试1": 85, "考试2": 95, "考试3": 92},
 "002": {"姓名": "小李", "考试1": 91, "考试2": 92, "考试3": 94},
 "003": {"姓名": "小王", "考试1": 86, "考试2": 81, "考试3": 89},
 "004": {"姓名": "小张", "考试1": 79, "考试2": 89, "考试3": 95},
 "005": {"姓名": "小赵", "考试1": 96, "考试2": 91, "考试3": 91},
 "006": {"姓名": "小周", "考试1": 81, "考试2": 89, "考试3": 92}
 })
students = students.T
students

     姓名 考试1 考试2 考试3
001  小陈  85  95  92
002  小李  91  92  94
003  小王  86  81  89
004  小张  79  89  95
005  小赵  96  91  91
006  小周  81  89  92

In [3]:
students["考试1"]

001    85
002    91
003    86
004    79
005    96
006    81
Name: 考试1, dtype: object

In [4]:
students["姓名"]

001    小陈
002    小李
003    小王
004    小张
005    小赵
006    小周
Name: 姓名, dtype: object

#### 创建一个叫`student_average`的DataFrame，索引为学号，包含姓名列（列名为“姓名”），以及计算出四次考试平均值后的结果列（列名为“平均分”）。

In [5]:
students_1 = students.drop("姓名", axis=1)
students_1

    考试1 考试2 考试3
001  85  95  92
002  91  92  94
003  86  81  89
004  79  89  95
005  96  91  91
006  81  89  92

In [6]:
students_1["考试1"]

001    85
002    91
003    86
004    79
005    96
006    81
Name: 考试1, dtype: object

In [7]:
students_mean = students_1.mean(axis=1)
students_mean

001    90.666667
002    92.333333
003    85.333333
004    87.666667
005    92.666667
006    87.333333
dtype: float64

In [8]:
students_name = students["姓名"]
students_name

001    小陈
002    小李
003    小王
004    小张
005    小赵
006    小周
Name: 姓名, dtype: object

In [9]:
students_avarage = pd.DataFrame(students_name)
students_avarage["平均分"] = students_mean
students_avarage

     姓名        平均分
001  小陈  90.666667
002  小李  92.333333
003  小王  85.333333
004  小张  87.666667
005  小赵  92.666667
006  小周  87.333333

#### 输出每次考试第二高的分数组成的Series，可以尝试结合匿名函数。

In [10]:
def second_score(data):
    data_sorted = data.sort_values(ascending=False)
    return data_sorted.iloc[1]
students_1.apply(second_score, axis=0)

考试1    91
考试2    92
考试3    94
dtype: int64

In [11]:
import numpy as np  # numpy数组sort排序

In [12]:
students_1

    考试1 考试2 考试3
001  85  95  92
002  91  92  94
003  86  81  89
004  79  89  95
005  96  91  91
006  81  89  92

In [13]:
students_1.apply(lambda x: np.sort(x)[-2])

考试1    91
考试2    92
考试3    94
dtype: int64

#### 根据以下规则，输出每个学号对应的三次考试的等级：
- A+：分数 >= 95
- A：90 <= 分数 < 95
- B+：85 <= 分数 < 90
- B：80 <= 分数 < 85
- C+：75 <= 分数 < 80
- C：分数 < 75

In [14]:
def grade(data):
    if data >= 95:
        return "A+"
    elif 95 > data >= 90:
        return "A"
    elif 90 > data >= 85:
        return "B+"
    elif 85 > data >= 80:
        return "B"
    elif 80 > data >= 75:
        return "C+"
    else:
        return "C"
students_grade = students_1.applymap(grade)
students_grade

    考试1 考试2 考试3
001  B+  A+   A
002   A   A   A
003  B+   B  B+
004  C+  B+  A+
005  A+   A   A
006   B  B+   A

#### 展示`students`每个考试分数数据列的统计信息，包括个数、平均值、标准差、四分位数等。

In [15]:
students_1.describe()

        考试1  考试2  考试3
count     6    6    6
unique    6    5    5
top      85   89   92
freq      1    2    2

In [16]:
students["考试1"]  # object不是数字类型不能进行describe，
# DataFrame会忽略非数字，如果DataFrame中的既有数字也有非数字就会出现object

001    85
002    91
003    86
004    79
005    96
006    81
Name: 考试1, dtype: object

In [17]:
students["考试1"].describe()  
# Series类型是object没有关系，统计计算会自动转化为数字。
# 而DataFrame的object不能直接进行统计操作，

count      6
unique     6
top       85
freq       1
Name: 考试1, dtype: int64

In [18]:
students_1.astype(float)  # 转换DataFrame中的数据

      考试1   考试2   考试3
001  85.0  95.0  92.0
002  91.0  92.0  94.0
003  86.0  81.0  89.0
004  79.0  89.0  95.0
005  96.0  91.0  91.0
006  81.0  89.0  92.0

In [19]:
students["考试1"] = students["考试1"].astype(float)
students["考试2"] = students["考试2"].astype(float)
students["考试3"] = students["考试3"].astype(float)
students

     姓名   考试1   考试2   考试3
001  小陈  85.0  95.0  92.0
002  小李  91.0  92.0  94.0
003  小王  86.0  81.0  89.0
004  小张  79.0  89.0  95.0
005  小赵  96.0  91.0  91.0
006  小周  81.0  89.0  92.0

In [20]:
students.describe()

             考试1        考试2        考试3
count   6.000000   6.000000   6.000000
mean   86.333333  89.500000  92.166667
std     6.314006   4.722288   2.136976
min    79.000000  81.000000  89.000000
25%    82.000000  89.000000  91.250000
50%    85.500000  90.000000  92.000000
75%    89.750000  91.750000  93.500000
max    96.000000  95.000000  95.000000

In [23]:
students["考试1"].describe()

count     6.000000
mean     86.333333
std       6.314006
min      79.000000
25%      82.000000
50%      85.500000
75%      89.750000
max      96.000000
Name: 考试1, dtype: float64